Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: goto line in file
zh_cn: 转到文件中的行

source: groups of breakpoints
zh_cn: 断点组

source: hashCode () for arrays is not supported
zh_cn: hashCode() 不支持数组

source: hierarchy browser
zh_cn: 层次浏览器

source: highlight exit points
zh_cn: 高亮退出点

source: highlight implements
zh_cn: 高亮实现

source: highlight method exit point
zh_cn: 高亮方法退出点

source: highlight throws
zh_cn: 高亮抛出

source: highlight usages in file
zh_cn: 在文件中高亮使用

source: hippie completion
zh_cn: hippie 补全

source: horizontal scrolling
zh_cn: 水平滚动

source: html5 outline
zh_cn: HTML5 大纲

source: idle time: {0}
zh_cn: 空闲时间：{0}

source: image file completion
zh_cn: 图像文件补全

source: images lookup
zh_cn: 图片查找

source: implement interface
zh_cn: 实现接口

source: implementors of interface (within hierarchy)
zh_cn: 接口的实现者(层次结构)

source: implements
zh_cn: 实现

source: implements methods of the following classes/interfaces:
zh_cn: 实现以下类/接口的方法:

source: implements {0}
zh_cn: 实现 {0}

source: implements {0} {1} {2}.
zh_cn: 实现了 {1} {2} 的 {0}。

source: implicit ant properties
zh_cn: 隐含的 Ant 属性

source: implicit constructor of
zh_cn: 隐式的构造函数

source: implicit constructor of {0}
zh_cn: {0} 的隐式构造函数

source: in
zh_cn: 在

source: in a few moments
zh_cn: 稍后

source: in a method and press the Tab key to see what happens.
zh_cn: ，然后按 Tab 键看会发生什么。

source: in comments
zh_cn: 在注释中

source: in group ''{0}''
zh_cn: 在 ''{0}'' 组中

source: in string literals
zh_cn: 在字符串中

source: in {0,choice, 0#zero days|1#one day|2#{0,number} days}
zh_cn: {0,number} 天内

source: in {0,choice, 0#zero hours|1#one hour|2#{0,number} hours}
zh_cn: {0,number} 小时内

source: in {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes}
zh_cn: {0,number} 分钟内

source: in {0,choice, 0#zero months|1#one month|2#{0,number} months}
zh_cn: {0,number} 个月内

source: in {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks}
zh_cn: {0,number} 星期内

source: in {0,choice, 0#zero years|1#one year|2#{0,number} years}
zh_cn: {0,number} 年内

source: infos
zh_cn: 信息

source: initMergeContent
zh_cn: 初始化合并内容

source: initializer
zh_cn: 初始化

source: inline all occurrences of the method, and delete the method
zh_cn: 内联该方法的所有匹配项，并删除该方法

source: inline method
zh_cn: 内联方法

source: inline only a single occurrence, and retain the method
zh_cn: 内联仅一个匹配项，并保留该方法

source: inline refactoring
zh_cn: 内联重构

source: inline variable
zh_cn: 内联变量

source: inner classes
zh_cn: 内部类

source: insert imports on paste
zh_cn: 粘贴时插入导入

source: insert in commander
zh_cn: 控制面板中插入

source: insert live template
zh_cn: 插入代码模板

source: inspect code
zh_cn: 检查代码

source: inspect expression
zh_cn: 检查表达式

source: inspection profile
zh_cn: 检查配置文件

source: instance fields of the class
zh_cn: 类的实例字段

source: instance initialization blocks
zh_cn: 实例初始化块

source: instance initializer
zh_cn: 实例初始化器

source: instance initializer of class {0}
zh_cn: 类 {0} 的实例化初始器

source: interface
zh_cn: 接口

source: interface that is not implemented or extended
zh_cn: 未实现或继承的接口

source: interface {0}
zh_cn: 接口 {0}

source: interfaces
zh_cn: 接口

source: interpreter
zh_cn: 解释器

source: introduce constant
zh_cn: 引入常量

source: introduce variable
zh_cn: 引入变量

source: introduce variable incomplete code
zh_cn: 不完整代码引入变量

source: invalid item ''{0}'' in the dependencies list
zh_cn: 依赖关系列表中的无效项 ''{0}''

source: invalid {0} {1, choice, 1#root|2#roots}
zh_cn: 无效的 {0} 个根目录

source: invalidated item
zh_cn: 无效项目

source: issue navigation
zh_cn: 问题导航

source: items
zh_cn: 项

source: jar diff
zh_cn: jar 差异

source: java version "{0}"
zh_cn: java 版本 "{0}"

source: javadoc annotated class
zh_cn: javadoc 注解类

source: javadoc annotated fields
zh_cn: javadoc 注释字段

source: javadoc annotated methods
zh_cn: javadoc 注释方法

source: javadoc exited with exit code $EXIT_CODE$
zh_cn: javadoc 退出，退出码为 $EXITCODE$(_C)

source: javadoc tags
zh_cn: javadoc 标签

source: join lines
zh_cn: 连接行

source: jump between test and test subject
zh_cn: 在测试和测试主题之间跳转

source: jump to last edit
zh_cn: 跳转到最后一次编辑

source: junit test cases
zh_cn: junit 测试用例

source: junit.jar not found in module ''{0}'' class path.
zh_cn: junit.jar 没有在模块 ''{0}'' 的类路径中找到。

source: keep order
zh_cn: 保持排序

source: la&yout support
zh_cn: 布局支持(&Y)

source: label
zh_cn: 标签

source: lambda expression
zh_cn: lambda 表达式

source: last operation
zh_cn: 最后操作

source: last undone operation
zh_cn: 最后撤销操作

source: launch console
zh_cn: 启动控制台

source: layout code
zh_cn: 布局代码

source: lens mode
zh_cn: 透镜模式

source: less than 1 day
zh_cn: 不足 1 天

source: less than a minute
zh_cn: 不到一分钟

source: less...
zh_cn: 更少...

source: lib directory not found in {0}
zh_cn: {0} 中未找到 lib 目录

source: line ({0})
zh_cn: 行({0})

source: line endings
zh_cn: 换行符

source: line endings folder
zh_cn: 为文件夹修改换行符

source: line {0} in {1}
zh_cn: {1} 中的 {0} 行

source: lines
zh_cn: 行

source: lines {0} to {1} in {2}
zh_cn: {2} 中的 {0} 到 {1} 行

source: live templates
zh_cn: 代码模板

source: live templates django
zh_cn: django 代码模板

source: live templates restore
zh_cn: 代码模板重置

source: loading
zh_cn: 加载中

source: loading...
zh_cn: 加载中...

source: local
zh_cn: 本地

source: local VCS
zh_cn: 本地 VCS

source: local elements/global complex types
zh_cn: 局部元素/全局复杂类型

source: local elements/types
zh_cn: 局部元素/类型

source: local history
zh_cn: 本地历史

source: local variable
zh_cn: 局部变量

source: local variable {0}
zh_cn: 局部变量 {0}

source: locate duplicates
zh_cn: 查找重复

source: locked {0}
zh_cn: 锁 {0}

source: logging without if
zh_cn: logging 没有 if

source: main() method declaration
zh_cn: main() 方法声明

source: managepy
zh_cn: 管理 py

source: match
zh_cn: 匹配

source: maven quick open
zh_cn: maven 快速打开

source: maxOccurs value should be greater than minOccurs value
zh_cn: maxOccurs 值应该大于 minOccurs 值

source: menu items descriptions
zh_cn: 菜单项的描述

source: method
zh_cn: 方法

source: method calls
zh_cn: 方法调用

source: method calls to deprecated methods
zh_cn: 方法调用已弃用的方法

source: method is defined in the class
zh_cn: 方法在类中已定义

source: method is not defined in the class but defined in superclass
zh_cn: 方法没有在类中定义，但是在超类中定义

source: method references
zh_cn: 方法引用

source: method separators
zh_cn: 方法分隔线

source: method should be defined since the class is not abstract
zh_cn: 应该定义方法，因为该类不是抽象的

source: method up down
zh_cn: 方法间上下称动

source: method {0}
zh_cn: 方法 {0}

source: methods have unrelated return types
zh_cn: 方法具有不相关的返回类型

source: methods of the class
zh_cn: 类的方法

source: min occurs: {0}, max occurs: {1}
zh_cn: 最小匹配项: {0}, 最大匹配项: {1}

source: miscellaneous
zh_cn: 其他

source: mm
zh_cn: 毫米

source: model dependency diagram jump to source
zh_cn: 模型依赖关系图跳转到源代码

source: modify editor content
zh_cn: 修改编辑内容

source: module
zh_cn: 模块

source: module ''{0}''
zh_cn: 模块 ''{0}''

source: modules
zh_cn: 模块

source: moments ago
zh_cn: 刚才

source: more...
zh_cn: 更多...

source: move
zh_cn: 移动

source: move file to changelist
zh_cn: 移到文件到更改列表

source: move inner to upper
zh_cn: 内部类移出

source: move module refactoring
zh_cn: 移动模块重构

source: move to changelist
zh_cn: 移到更改列表

source: move up down
zh_cn: 上下移

source: ms
zh_cn: 毫秒

source: multicursor
zh_cn: 多个光标

source: multicursor 1
zh_cn: 多个光标 1

source: multiple carets
zh_cn: 多个插入符号

source: multiple projects
zh_cn: 多个项目

source: multiselection
zh_cn: 多选

source: multiselection 1
zh_cn: 多选 1

source: multiselection 2
zh_cn: 多选 2

source: multiselection in search
zh_cn: 搜索中的多选

source: multiselection in search 1
zh_cn: 搜索中的多选 1

source: multiselection words
zh_cn: 多选单词

source: named breakpoints
zh_cn: 命名断点

source: namespace
zh_cn: 命名空间

source: nav bar
zh_cn: 导航栏

source: navigate from stack trace
zh_cn: 从堆栈跟踪导航

source: navigate to file path
zh_cn: 导航到文件路径

source: new expressions
zh_cn: new 表达式

source: next prev error
zh_cn: 下一个/上一个错误

source: no constraints specified
zh_cn: 没有指定约束

source: no matches found
zh_cn: 找不到匹配项

source: noname
zh_cn: 无名

source: nonexistent
zh_cn: 不存在

source: not annotated methods
zh_cn: 未注解方法

source: not ready yet
zh_cn: 还没有准备好

source: not within {0}
zh_cn: 不在 {0} 内

source: null context
zh_cn: 空上下文

source: occurrence
zh_cn: 匹配项

source: occurrences of ''{0}''
zh_cn: ''{0}'' 的匹配项

source: occurs: {0}
zh_cn: 匹配项: {0}

source: of class
zh_cn: 类

source: of interface
zh_cn: 接口

source: only in
zh_cn: 仅在

source: operators
zh_cn: 操作符

source: optimize imports
zh_cn: 优化导入

source: or
zh_cn: 或

source: or if tag size more than
zh_cn: 或者如果标签尺寸超过

source: or supertype
zh_cn: 或超类型

source: order by name
zh_cn: 通过名字排序

source: override implement methods
zh_cn: 重写/实现方法

source: overrides
zh_cn: 重写

source: overrides {0} {1} {2}.
zh_cn: 重写了 {1} {2} 的 {0}。

source: package
zh_cn: 包

source: package {0}
zh_cn: 包 {0}

source: package-private fields of the class
zh_cn: 类的 package-private 字段

source: param info
zh_cn: 参数信息

source: parameter
zh_cn: 参数

source: parameter info
zh_cn: 参数信息

source: parameter {0}
zh_cn: 参数 {0}

source: parent was renamed
zh_cn: 父被重命名

source: partial completion
zh_cn: 部分补全

source: partialdeclaration
zh_cn: 部分声明

source: paste from history
zh_cn: 从历史记录粘贴

source: pos:{0}
zh_cn: 位置:{0}

source: postfix completion
zh_cn: 后缀补全

source: predicate is always true
zh_cn: 谓词一直是 true

source: preview TODO
zh_cn: 预览 TODO

source: print keywords
zh_cn: 打印关键词

source: problem_class
zh_cn: 问题类(_C)

source: problems
zh_cn: 问题

source: process only VCS changed files
zh_cn: 只处理 VCS 更改的文件

source: project
zh_cn: 项目

source: properties completion
zh_cn: 属性补全

source: property
zh_cn: 属性

source: py color files
zh_cn: 颜色标记 py 文件

source: quick definition
zh_cn: 快速定义

source: quick doc
zh_cn: 快速文档

source: quick doc in suggestion list
zh_cn: 建议列表中的快速文档

source: quick doc on mouse move
zh_cn: 鼠标移动时的快速文档

source: quick evaluate expression
zh_cn: 快速计算表达式

source: quick fix
zh_cn: 快速解决

source: quick fix right arrow
zh_cn: 快速修复的右箭头

source: quick java doc
zh_cn: 快速 java 文档

source: quick java doc in lookups
zh_cn: 查阅列表中的快速 java 文档

source: quick switch scheme
zh_cn: 快速切换方案

source: recent changes
zh_cn: 最近的更改

source: recent files
zh_cn: 最近的文件

source: recent search
zh_cn: 最近搜索

source: refactor this
zh_cn: 重构

source: reference target{0} like: {1}
zh_cn: 引用目标{0} 如: {1}

source: reformat code
zh_cn: 重新格式化代码

source: remote interpreter
zh_cn: 远程解释器

source: remove tool window button
zh_cn: 移除工具窗口按钮

source: rename
zh_cn: 重命名

source: rename css selector
zh_cn: 重命名 css 选择器

source: rename refactoring
zh_cn: 重命名重构

source: renamed field will hide {0}
zh_cn: 重命名字段将隐藏 {0}

source: reopen
zh_cn: 重新打开

source: replace all occurrences of the expression
zh_cn: 替换表达式的所有匹配项

source: replace only a single occurrence of the expression
zh_cn: 仅替换表达式的单个匹配项

source: required by {0,choice,1#interface|2#interfaces}
zh_cn: 被接口所需

source: result
zh_cn: 结果

source: return statement
zh_cn: return 语句

source: rich text copy
zh_cn: 富文本复制

source: right now
zh_cn: 马上

source: rubocop auto check
zh_cn: rubocop 自动检查

source: rubocop manual check
zh_cn: rubocop 手动检查

source: rubyI18n
zh_cn: ruby 国际化

source: run config folders
zh_cn: 分组运行配置

source: run rake task
zh_cn: 运行 rake 任务

source: run with gutter
zh_cn: 使用 gutter 运行

source: run with intention action
zh_cn: 使用意向操作运行

source: s
zh_cn: 秒

source: sample method invocation with constant parameter
zh_cn: 采用常量参数调用样本方法

source: scope
zh_cn: 范围

source: scopes in TODO
zh_cn: TODO 的范围

source: scratch
zh_cn: 临时文件

source: scratch file
zh_cn: 临时文件

source: scratches view
zh_cn: 临时文件视图

source: script:
zh_cn: 脚本:

source: script: {0}
zh_cn: 脚本：{0}

source: search everywhere
zh_cn: 全局搜索

source: search in settings
zh_cn: 在设置中搜索

source: search in supers
zh_cn: 在 supers 中搜索

source: searching...
zh_cn: 搜索中...

source: sec.
zh_cn: 秒。

source: second basic class name completion
zh_cn: 第二次智能补全类名

source: second smart completion array member
zh_cn: 第二次智能补全数组成员

source: second smart completion as list
zh_cn: 第二次智能补全 asList

source: second smart completion chain
zh_cn: 第二次智能补全链式

source: second smart completion toar
zh_cn: 第二次智能补全 toArray

source: select in
zh_cn: 选择

source: select run debug configuration
zh_cn: 选择运行调试配置

source: select tasks
zh_cn: 选择任务

source: select word
zh_cn: 选择单词

source: selection
zh_cn: 选择

source: semantic highlighting
zh_cn: 语义高亮

source: session ejb
zh_cn: 会话 ejb

source: set&Up/@Before
zh_cn: setUp/@Before(&U)

source: shared memory
zh_cn: 共享内存

source: show applied styles
zh_cn: 显示应用的样式

source: show hide side bars
zh_cn: 显示隐藏侧栏

source: show implementations
zh_cn: 显示实现

source: show usages
zh_cn: 显示使用

source: similar methods structure
zh_cn: 类似的方法结构

source: singletons
zh_cn: 单例

source: smart end
zh_cn: 智能结束

source: smart type after new
zh_cn: new 之后的智能类型补全

source: smart type casting
zh_cn: 智能类型转换

source: smart type completion
zh_cn: 智能类型补全

source: some files already exist
zh_cn: 一些文件已经存在

source: some files are read-only
zh_cn: 一些文件是只读的

source: some files was moved to or from outside of the directory
zh_cn: 一些文件被移动到或从目录外部移动

source: special characters
zh_cn: 特殊字符

source: speed search
zh_cn: 快速搜索

source: speed search in commander
zh_cn: 控制面板中的快速搜索

source: speed searchin live templates
zh_cn: 在代板模板中快速搜索

source: spellchecker
zh_cn: 拼写检查

source: spellchecker dictionaries
zh_cn: 拼写检查字典

source: static blocks in class
zh_cn: 类中的静态块

source: static fields that are not final
zh_cn: 不是 final 的静态字段

source: static initializer
zh_cn: 静态初始化器

source: static initializer of class {0}
zh_cn: 类 {0} 的静态化初始器

source: status: ''{0}''
zh_cn: 状态:''{0}''

source: string concatenations
zh_cn: 字符串连接

source: string literals
zh_cn: 字符串文字

source: structure popup
zh_cn: 结构弹窗

source: subsequent ''{0}'' call makes sorting useless
zh_cn: 随后的 ''{0}'' 调用使排序无用

source: surround with
zh_cn: 包围

source: switch camel to snake
zh_cn: 切换驼峰为下划线

source: switcher
zh_cn: 切换器

source: symbol
zh_cn: 符号

source: synchronize views in commander
zh_cn: 控制面板中同步视图

source: tab in editor close
zh_cn: 编辑器中关闭选项卡

source: tab in lookups
zh_cn: 查找结果中使用 tab

source: tag
zh_cn: 标签

source: tag name completion
zh_cn: 标签名称补全

source: target
zh_cn: 目标

source: tear&Down/@After
zh_cn: tearDown/@After(&D)

source: templates
zh_cn: 模板

source: terminal
zh_cn: 终端

source: terminal open
zh_cn: 终端打开

source: text{0} like: {1}
zh_cn: 文本 {0} 如: {1}

source: the specified pattern does not match anything in scope ''{0}''
zh_cn: 指定的模式在范围 ''{0}'' 内不匹配任何内容

source: the specified pattern is malformed
zh_cn: 该模式格式错误

source: the specified pattern is unsupported
zh_cn: 该此模式不受支持

source: then the resource bundle editor will show
zh_cn: 那么资源束编辑器将显示

source: there already was a 'distinct' call in the chain
zh_cn: 链中已经有一个 'distinct' 调用

source: there already was an 'unordered' call in the chain
zh_cn: 链中已经有一个 'unordered' 调用

source: there''s subsequent ''{0}'' call which overrides this call
zh_cn: 接下来的 ''{0}'' 调用覆盖了这个调用

source: to delete (with usage search)
zh_cn: 删除 (包括使用搜索)

source: to find usages of
zh_cn: 查找使用对

source: to refactor
zh_cn: 重构

source: to rename
zh_cn: 重命名

source: toString() issues
zh_cn: toString() 问题

source: tool windows quick access
zh_cn: 工具窗口快速访问

source: type
zh_cn: 类型

source: type hinting
zh_cn: 类型提示

source: type parameter
zh_cn: 类型参数

source: type use
zh_cn: 类型使用

source: type var substitutions in intanceof with generic types
zh_cn: 使用通用类型在 instanceof 中键入 var 替换

source: typed symbol
zh_cn: typed 符号

source: type{2}{0} like: {1}
zh_cn: 类型 {2}{0} 如: {1}

source: unboxed expressions
zh_cn: 未装箱的表达式

source: unboxing in declarations
zh_cn: 在声明中拆箱

source: unboxing in method calls
zh_cn: 在方法调用中拆箱

source: undefined
zh_cn: 未定义

source: unknown
zh_cn: 未知

source: unknown jsp
zh_cn: 未知的 jsp

source: unknown module ''{0}''
zh_cn: 未知模块 ''{0}''

source: unnamed
zh_cn: 未命名

source: unused declaration
zh_cn: 未使用的声明

source: update project
zh_cn: 更新项目

source: updating...
zh_cn: 更新中...

source: upload ssh key
zh_cn: 上传 ssh 密钥

source: usage
zh_cn: 使用

source: usage of derived type in cast
zh_cn: 派生类型的使用

source: usages
zh_cn: 使用

source: used by {0}
zh_cn: 被 {0} 使用

source: user defined
zh_cn: 用户自定义

source: uses {0}
zh_cn: 使用 {0}

source: using file system
zh_cn: 使用文件系统

source: using {0}
zh_cn: 使用 {0}

source: value is{0} read
zh_cn: 值为 {0} 读

source: value is{0} written
zh_cn: 值为 {0} 写

source: variable
zh_cn: 变量

source: variable name completion
zh_cn: 变量名补全

source: variables of generic types
zh_cn: 泛型类型的变量

source: vcs quick list
zh_cn: vcs 快速列表

source: view in browser
zh_cn: 在浏览器中查看

source: waiting for {0} to release lock on {1}
zh_cn: 等待 {0} 释放锁 {1}

source: warnings
zh_cn: 警告

source: welcome
zh_cn: 欢迎

source: wide screen
zh_cn: 加宽屏幕

source: wildcards in navigation popups
zh_cn: 在导航弹窗中的通配符

source: with &JavaScript debugger
zh_cn: 用 JavaScript 调试器(&J)

source: with mask ''{0}''
zh_cn: 使用掩码 ''{0}''

source: within {0}
zh_cn: 在 {0} 内

source: word completion
zh_cn: 单词补全

source: {0, choice, 0#No changes|1#One change|2#{0, number} changes}.
zh_cn: {0, choice, 0#无更改|1#1 更改|2#{0, number} 更改}.

source: {0, choice, 0#No differences|1#1 difference|2#{0, number} differences}
zh_cn: {0, choice, 0#无差异|1#1 差异|2#{0, number} 差异}

source: {0, choice, 0#No instantiations|1#1 instantiation|2#{0, number} instantiations} found in the project code.
zh_cn: 项目代码中找到 {0, choice, 0#0 个实例|1#1 个实例|2#{0, number} 个实例} 。

source: {0, choice, 0#No matches|1#One match|2#{0} matches}
zh_cn: {0, choice, 0#无匹配|1#1 个匹配|2#{0} 个匹配}

source: {0, choice, 0#|1#(1 item)|2#({0,number,integer} items)}
zh_cn: {0, choice, 0#|1#(1 项)|2#({0,number,integer} 项)}

source: {0, choice, 1#1 code fragment|2#{0,number} code fragments} found
zh_cn: {0,number} 个代码片断找到

source: {0, choice, 1#1 instantiation|2#{0, number} instantiations} found in the project code.
zh_cn: 项目代码中找到 {0, choice, 1#1 个实例|2#{0, number} 个实例} 。

source: {0, choice, 1#1 occurrence|2#{0,number} occurrences} changed
zh_cn: {0,number} 个匹配项已改变

source: {0, choice, 1#1 usage|2#{0, number} usages} found in the project code.
zh_cn: 项目代码中找到 {0, choice, 1#1 个使用|2#{0, number} 个使用} 。

source: {0, choice, 1#An output directory which doesn''t|2#{0} output directories which don''''t} correspond to existing modules {0, choice, 1#is|2#are} found under {1}.
zh_cn: 在 {1} 下找到 {0} 个找到与现有模块不相对应的输出目录

source: {0, choice, 1#File|2#Files} {1} {0, choice, 1#has|2#have} been packaged at {2}.
zh_cn: {0, choice, 1#文件|2#文件} {1} {0, choice, 1#已经|2#已经} 打包在 {2} 里。

source: {0, number} {0, choice, 1#hunk is|2#hunks are} already applied
zh_cn: {0, number} 块已应用

source: {0,choice, 0# files|1# file|2# files}
zh_cn: {0} 个文件

source: {0,choice, 0# matches|1# match|2# matches}
zh_cn: {0,number}个匹配

source: {0,choice, 0#Class has no fields|1#Select Field}
zh_cn: {0,choice, 0#类没有字段|1#选择字段}

source: {0,choice, 0#Moments|1#A minute|2#{0,number} minutes|60#1 hour} ago
zh_cn: {0,choice, 0#片刻|1#1 分钟|2#{0,number} 分钟|60#1 小时}之前

source: {0,choice, 0#Never|1#Once|2#Twice|3#{0,number} times}
zh_cn: {0,choice, 0#从未|1#1次|2#2次|3#{0,number} 次}

source: {0,choice, 0#No directories|1#1 directory|2#{0} directories}
zh_cn: {0} 个目录

source: {0,choice, 0#No directories|1#1 directory|2#{0} directories} and {1,choice, 0#no files|1#1 file|2#{1} files}
zh_cn: {0} 个目录和 {1} 个文件

source: {0,choice, 0#No errors|1#One error|2#{0} errors} and {1,choice, 0#no warnings|1#one warning|2#{1} warnings} found.
zh_cn: 找到 {0} 个错误和 {1} 个警告。

source: {0,choice, 0#No files|1#1 file|2#{0} files}
zh_cn: {0} 个文件

source: {0,choice, 0#Not Found|1#1 occurrence|2#{0,number} occurrences}{1,choice, 0#|1# in 1 file|2# in {1,number} files}
zh_cn: {0,number} 个匹配项在 {1,number} 个文件中

source: {0,choice, 0#Not Found|1#1 reference|2#{0,number} references}{1,choice, 0#|1# in 1 file|2# in {1,number} files}
zh_cn: {0,number} 个引用在 {1,number} 个文件中

source: {0,choice, 0#Not Found|1#1 usage|2#{0,number} usages}{1,choice, 0#|1# in 1 file|2# in {1,number} files}
zh_cn: {0,number} 个使用在 {1,number} 个文件中

source: {0,choice, 0#No|1#1 too large file was ignored|2#{0,number} too large files were ignored}
zh_cn: {0,number} 个过大文件已被忽略

source: {0,choice, 0#no items|1#1 item|2#{0, number} items}
zh_cn: {0, number} 项

source: {0,choice, 0#no usages|1#1 usage|2#{0,number} usages} found
zh_cn: 找到 {0,number} 个使用

source: {0,choice, 0#zero days|1#one day|2#{0,number} days}
zh_cn: {0,number} 天

source: {0,choice, 0#zero days|1#one day|2#{0,number} days} ago
zh_cn: {0,number} 天前

source: {0,choice, 0#zero hours|1#one hour|2#{0,number} hours}
zh_cn: {0,number} 小时

source: {0,choice, 0#zero hours|1#one hour|2#{0,number} hours} ago
zh_cn: {0,number} 小时前

source: {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes}
zh_cn: {0,number} 分钟

source: {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes} ago
zh_cn: {0,number} 分钟前

source: {0,choice, 0#zero months|1#one month|2#{0,number} months}
zh_cn: {0,number} 月

source: {0,choice, 0#zero months|1#one month|2#{0,number} months} ago
zh_cn: {0,number} 个月前

source: {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks}
zh_cn: {0,number} 个星期

source: {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks} ago
zh_cn: {0,number} 星期前

source: {0,choice, 0#zero years|1#one year|2#{0,number} years}
zh_cn: {0,number} 年

source: {0,choice, 0#zero years|1#one year|2#{0,number} years} ago
zh_cn: {0,number} 年前

source: {0,choice, 1#Invalid argument|2#Invalid arguments}
zh_cn: {0,choice, 1#无效参数|2#无效参数}

source: {0,choice, 1#Remove Watch|2#Remove Watches}
zh_cn: {0,choice, 1#移除观察点|2#移除观察点}

source: {0,choice,-1#not calculated|0#{0,number} of {1}}
zh_cn: {0,choice,-1#未计算|0#{0,number} / {1}}

source: {0,choice,0#Empty array is|1#Single-item array is|1<{0} array items are} expected
zh_cn: 期望 {0,choice,0#空|1#单元素|1<{0} 元素} 数组

source: {0,choice,0#File|1#Directory} _Path
zh_cn: {0,choice,0#File|1#Directory} 路径(_P)

source: {0,choice,0#No arguments are|1#One argument is|1<{0} arguments are} expected
zh_cn: 期望 {0} 个参数

source: {0,choice,0#No|1#{0}} {0,choice,0#occurrences|1#occurrence|2#occurrences} found so far
zh_cn: 目前找到 {0} 个匹配项

source: {0,choice,0#No|1#{0}} {0,choice,0#occurrences|1#occurrence|2#occurrences} replaced
zh_cn: {0} 个匹配项已替换

source: {0,choice,1#Plugin|2#Plugins} incompatible with the new build found:{0,choice,1#' '|2#'<br/>'} {1}
zh_cn: 插件与发现的新版本不兼容:{0,choice,1# ' ' |2# '<br/>' } {1}

source: {0,choice,1#directory|2#directories}
zh_cn: 个目录

source: {0,choice,1#interface|2#interfaces}
zh_cn: 个接口

source: {0,choice,1#property|2#properties}
zh_cn: 个属性值

source: {0,choice,1#type parameter|2#type parameters}
zh_cn: 个类型参数

source: {0,number,####} of {1,number,####}M
zh_cn: {0,number,####} / {1,number,####}M

source: {0,number} {0,choice, 0#classes|1#class|2#classes} reloaded
zh_cn: {0,number} {0,choice, 0#个类|1#个类|2#个类} 重新加载

source: {0,number} {0,choice, 1#usage was|2#usages were} filtered out
zh_cn: 过滤出 {0,number} 个使用

source: {0} Content of these files won''t be changed during revert that may result in code corruption.
zh_cn: {0} 这些文件的内容在还原期间不会被更改，可能会导致代码损坏。

source: {0} Would you like to overwrite {1,choice,1#it|2#these files}?
zh_cn: {0} 你想要覆盖吗？

source: {0} &module ''{1}''
zh_cn: {0} 模块 ''{1}''(&M)

source: {0} ''{1}'' belongs to {2}.
zh_cn: {0} ''{1}'' 属于 {2} 。

source: {0} ''{1}'' causes dependency cycle and cannot be added
zh_cn: {0} ''{1}'' 导致依赖关系循环，无法添加

source: {0} ''{1}'' does not have type parameters
zh_cn: {0} ''{1}'' 没有类型参数

source: {0} ''{1}'' in {2}
zh_cn: {0} ''{1}'' 在 {2} 中

source: {0} ( Repository Version )
zh_cn: {0} (仓库)

source: {0} (found {1} {1,choice,1#item|2#items})
zh_cn: {0}(找到 {1} 个项)

source: {0} (in {1})
zh_cn: {0}(在 {1} 中)

source: {0} (no items found)
zh_cn: {0}(没找到项)

source: {0} ({1} {1,choice,0#items|1#item|2#items} in {2} {2,choice,0#files|1#file|2#files})
zh_cn: {0}({1} 个项, 位于 {2} 个文件)

source: {0} Changelist
zh_cn: {0} 更改列表

source: {0} Changes
zh_cn: {0} 更改

source: {0} Destination is a directory.
zh_cn: {0} 目标是一个目录。

source: {0} Directories
zh_cn: {0} 目录

source: {0} Directory
zh_cn: {0} 目录

source: {0} Errors
zh_cn: {0} 错误

source: {0} Evaluation
zh_cn: {0} 评估许可证

source: {0} File
zh_cn: {0} 文件
